
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	// В данном коде необходимо сделать следующее
	//  - получить группу
	//  - получить актуальный список обучающихся на момент создания документа
	//  - по полученному списку получить их оценки по регистру ИтоговыеОценки
	//  - получить средний балл и выложить в столбец
	Объект.Обучающиеся.Очистить();
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Обучающиеся = РегистрыСведений.АктуальностьКонтингента.СрезПоследних(Объект.Дата);
	Для Каждого Обучающийся из Обучающиеся Цикл
		Если Обучающийся.Группа = Объект.Группа Тогда
			НоваяСтрока = Объект.Обучающиеся.Добавить();
			НоваяСтрока.ФИО = Обучающийся.Обучающийся;
			НоваяСтрока.СреднийБалл = 5;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
