
&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		НачалоСеместра = Объект.ДатаНачала;
		КонецСеместра = Объект.ДатаОкончания;
		
		РазницаВДнях = КонецСеместра - НачалоСеместра;
		РазницаВНеделях = Цел(РазницаВДнях / (60 * 60 * 24 * 7));
		Объект.КоличествоНедель = РазницаВНеделях;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		НачалоСеместра = Объект.ДатаНачала;
		КонецСеместра = Объект.ДатаОкончания;
		
		РазницаВДнях = КонецСеместра - НачалоСеместра;
		РазницаВНеделях = Цел(РазницаВДнях / 7);
		Объект.КоличествоНедель = РазницаВНеделях;
	КонецЕсли;
КонецПроцедуры
