Функция ТекущийПользователь() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

Функция ОпределитьКадры() Экспорт
	_Пользователь = Пользователи.ТекущийПользователь();
	_Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПривязкаПользователя.Сотрудник КАК Сотрудник,
	|	ПривязкаПользователя.УчетнаяЗапись КАК УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.ПривязкаПользователя КАК ПривязкаПользователя
	|ГДЕ
	|	ПривязкаПользователя.УчетнаяЗапись = &Пользователь");
	
	_Запрос.УстановитьПараметр("Пользователь", _Пользователь);
	Выборка = _Запрос.Выполнить().Выгрузить()[0];
	Сотрудник = Выборка.Сотрудник;
	
	Возврат Сотрудник;
КонецФункции