
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// статистика подписей
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ Справочник.Пользователи");
	ОбщСчетПользователи = Запрос.Выполнить().Выгрузить()[0][0];
	
	Элементы.ВсегоПользователей.Заголовок = "" + Элементы.ВсегоПользователей.Заголовок + ОбщСчетПользователи;
	
	//// статистика диаграммы
	//Запрос = Новый Запрос("ВЫБРАТЬ * Из Справочник.Пользователи");
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Статистика.Очистить();
	//
	//Пока Выборка.Следующий() Цикл
	//	Точка = Статистика.УстановитьТочку("Сумма");
	//	Серия = Статистика.УстановитьСерию(Выборка);
	//КонецЦикла;
КонецПроцедуры
