
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ Справочник.Контингент");
	ОбщСчетКонтингент = Запрос.Выполнить().Выгрузить()[0][0];
	
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ РегистрСведений.АктуальностьКонтингента.СрезПоследних КАК АктуальностьКонтингента ГДЕ АктуальностьКонтингента.Обучается = Истина");
	ОбщСчетНеКонтингент = Запрос.Выполнить().Выгрузить()[0][0];
	ОбщСчетНеКонтингент = ОбщСчетКонтингент - ОбщСчетНеКонтингент;
	
	Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) ИЗ Справочник.Пользователи");
	ОбщСчетПользователи = Запрос.Выполнить().Выгрузить()[0][0];
	
	Элементы.ОбщийКонтингент.Заголовок = "" + Элементы.ОбщийКонтингент.Заголовок + ОбщСчетКонтингент;
	Элементы.ВсегоПользователей.Заголовок = "" + Элементы.ВсегоПользователей.Заголовок + ОбщСчетПользователи;
	//Есть идея скрыть, если 0
	Элементы.КонтингентБезГруппы.Заголовок = "" + Элементы.КонтингентБезГруппы.Заголовок + ОбщСчетНеКонтингент;
	
	
КонецПроцедуры
