
&НаКлиенте
Процедура АбитуриентыФИОПриИзменении(Элемент)
	Строка = Элементы.Абитуриенты.ТекущиеДанные;
	Строка.Группа = ЗаполнитьДанныеДокумента(Объект.Дата, Строка.ФИО);
	
	Если ПустаяСтрока(Строка.Группа) Тогда
		Сообщить("Студент не состоит в группе!");
		Строка.ФИО = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДанныеДокумента(АктуальнаяДата, Элемент)
	Отбор = Новый Структура("Обучающийся", Элемент);
	
	ЗначениеРесурса = РегистрыСведений.АктуальностьКонтингента.ПолучитьПоследнее(АктуальнаяДата, Отбор);
	Возврат ЗначениеРесурса.Группа;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Абитуриенты = 0 Тогда
		Сообщить("Необходимо добавить минимум одного обучающегося!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
