
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПроведениеЗанятия.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроведениеЗанятия.Группа,
	|	ПроведениеЗанятия.ДатаЗанятия,
	|	ПроведениеЗанятия.Дисциплина,
	|	ПроведениеЗанятия.Преподаватель,
	|	ПроведениеЗанятия.Содержание,
	|	ПроведениеЗанятия.Тема,
	|	ПроведениеЗанятия.ФормаОрганизации,
	|	ПроведениеЗанятия.ИтогиПроведения.(
	|		НомерСтроки,
	|		Обучающийся,
	|		Отметка,
	|		Степень,
	|		Коментарий
	|	)
	|ИЗ
	|	Документ.ПроведениеЗанятия КАК ПроведениеЗанятия
	|ГДЕ
	|	ПроведениеЗанятия.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИтогиПроведенияШапка = Макет.ПолучитьОбласть("ИтогиПроведенияШапка");
	ОбластьИтогиПроведения = Макет.ПолучитьОбласть("ИтогиПроведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьИтогиПроведенияШапка);
		ВыборкаИтогиПроведения = Выборка.ИтогиПроведения.Выбрать();
		Пока ВыборкаИтогиПроведения.Следующий() Цикл
			ОбластьИтогиПроведения.Параметры.Заполнить(ВыборкаИтогиПроведения);
			ТабДок.Вывести(ОбластьИтогиПроведения, ВыборкаИтогиПроведения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
