Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаИтогиПроведения Из ИтогиПроведения Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Группа = Группа;
		Движение.Дисциплина = Дисциплина;
		Движение.ДатаЗанятия = ДатаЗанятия;
		Движение.Занятие = Занятие;
		Движение.Обучающийся = ТекСтрокаИтогиПроведения.Обучающийся;
		Движение.Отметка = ТекСтрокаИтогиПроведения.Отметка;
		Движение.Степень = ТекСтрокаИтогиПроведения.Степень;
		Движение.Комментарий = ТекСтрокаИтогиПроведения.Коментарий;
	КонецЦикла;
	
	// регистр УчебныйПлан
	Движения.УчебныйПлан.Записывать = Истина;
	Движение = Движения.УчебныйПлан.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Группа = Группа;
	Движение.Курс = Основание.УчебныйПлан.Курс;
	Движение.Дисциплина = Дисциплина;
	Движение.РабочаяПрограмма = Основание.УчебныйПлан.Содержание.Найти(Дисциплина, "Дисциплина").РабочаяПрограмма;
	Движение.Семестр = Семестр;
	Движение.Преподаватель = Преподаватель;
	Движение.ВсегоЧасов = 1;
	Если ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Лекция Тогда
		Движение.ЧасыЛекций = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПрактическоеЗанятие Тогда
		Движение.ЧасыПрактики = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Консультация Тогда
		Движение.ЧасыКонсультаций = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПромежуточнаяАттестация Тогда
		Движение.ЧасыАттестации = 1;
	КонецЕсли;
	
	РегистрЖурналов = РегистрыСведений.РасписаниеНаДату.СоздатьНаборЗаписей();
	РегистрЖурналов.Отбор.Регистратор.Установить(Основание);
	РегистрЖурналов.Прочитать();
	
	Для Каждого СтрокаРегистра Из РегистрЖурналов Цикл
		Если СтрокаРегистра.Группа = Группа 
			И СтрокаРегистра.Дисциплина = Дисциплина 
			И СтрокаРегистра.ДатаЗанятия = ДатаЗанятия 
			И СтрокаРегистра.Занятие = Занятие Тогда
			
			СтрокаРегистра.ЖурналЗаполнен = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если РегистрЖурналов.Модифицированность() Тогда
		РегистрЖурналов.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	РегистрЖурналов = РегистрыСведений.РасписаниеНаДату.СоздатьНаборЗаписей();
	РегистрЖурналов.Отбор.Регистратор.Установить(Основание);
	РегистрЖурналов.Прочитать();
	
	Для Каждого СтрокаРегистра Из РегистрЖурналов Цикл
		Если СтрокаРегистра.Группа = Группа 
			И СтрокаРегистра.Дисциплина = Дисциплина 
			И СтрокаРегистра.ДатаЗанятия = ДатаЗанятия 
			И СтрокаРегистра.Занятие = Занятие Тогда
			
			СтрокаРегистра.ЖурналЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если РегистрЖурналов.Модифицированность() Тогда
		РегистрЖурналов.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры