Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаИтогиПроведения Из ИтогиПроведения Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Группа = Группа;
		Движение.Дисциплина = Дисциплина;
		Движение.ДатаЗанятия = ДатаЗанятия;
		Движение.Занятие = Занятие;
		Движение.Обучающийся = ТекСтрокаИтогиПроведения.Обучающийся;
		Движение.Отметка = ТекСтрокаИтогиПроведения.Отметка;
		Движение.Степень = ТекСтрокаИтогиПроведения.Степень;
		Движение.Комментарий = ТекСтрокаИтогиПроведения.Коментарий;
	КонецЦикла;
	
	// регистр УчебныйПлан
	Движения.УчебныйПлан.Записывать = Истина;
	Движение = Движения.УчебныйПлан.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Группа = Группа;
	Движение.Курс = Основание.УчебныйПлан.Курс;
	Движение.Дисциплина = Дисциплина;
	Движение.РабочаяПрограмма = Основание.УчебныйПлан.Содержание.Найти(Дисциплина, "Дисциплина").РабочаяПрограмма;
	Движение.Семестр = Семестр;
	Движение.Преподаватель = Преподаватель;
	Движение.ВсегоЧасов = 1;
	Если ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Лекция Тогда
		Движение.ЧасыЛекций = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПрактическоеЗанятие Тогда
		Движение.ЧасыПрактики = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Консультация Тогда
		Движение.ЧасыКонсультаций = 1;
	ИначеЕсли ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПромежуточнаяАттестация Тогда
		Движение.ЧасыАттестации = 1;
	КонецЕсли;
КонецПроцедуры
