Процедура ПередЗаписью()
	ПерваяБуква = Лев(Наименование, 1);
	Код = ПрисваиваниеКодаСтуденту(ПерваяБуква);
КонецПроцедуры

&НаСервере
Функция ПрисваиваниеКодаСтуденту(ПерваяБуква)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Контингент.Наименование) КАК Наименование
	|ИЗ
	|	Справочник.Контингент КАК Контингент
	|ГДЕ
	|	Контингент.Наименование ПОДОБНО """ + ПерваяБуква + "%""");
	
	Запрос.УстановитьПараметр("ПерваяБуква", ПерваяБуква);
	
	Результат = Запрос.Выполнить().Выгрузить().Получить(0);
	Выборка = Результат.Наименование;
	
	Если Выборка = 0 Тогда
		Номер = 1;
	ИначеЕсли ЗначениеЗаполнено(Результат) Тогда
		Номер = Выборка + 1;
	Иначе
		Номер = 1;
	КонецЕсли;
	
	Идентификатор = ПерваяБуква + "-" + Формат(Номер, "0000");

	Возврат Идентификатор;
КонецФункции