
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПереводОбучающихся.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереводОбучающихся.Автор,
	|	ПереводОбучающихся.Дата,
	|	ПереводОбучающихся.Номер,
	|	ПереводОбучающихся.Абитуриенты.(
	|		НомерСтроки,
	|		ФИО,
	|		СтараяГруппа,
	|		НоваяГруппа,
	|		Причина
	|	)
	|ИЗ
	|	Документ.ПереводОбучающихся КАК ПереводОбучающихся
	|ГДЕ
	|	ПереводОбучающихся.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьАбитуриентыШапка = Макет.ПолучитьОбласть("АбитуриентыШапка");
	ОбластьАбитуриенты = Макет.ПолучитьОбласть("Абитуриенты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьАбитуриентыШапка);
		ВыборкаАбитуриенты = Выборка.Абитуриенты.Выбрать();
		Пока ВыборкаАбитуриенты.Следующий() Цикл
			ОбластьАбитуриенты.Параметры.Заполнить(ВыборкаАбитуриенты);
			ТабДок.Вывести(ОбластьАбитуриенты, ВыборкаАбитуриенты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
