
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Обучающийся = ТекСтрокаАбитуриенты.ФИО;
		Движение.Специальность = ТекСтрокаАбитуриенты.НоваяГруппа.Специальность;
		Движение.Группа = ТекСтрокаАбитуриенты.НоваяГруппа;
		Движение.Обучается = Истина;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Перевод;
		Движение.Причина = ТекСтрокаАбитуриенты.Причина;
	КонецЦикла;
	
	ТЗ = РаботаДокументов.РасчетЧисленности(Абитуриенты, "отчисление");
	
	// регистр ЧисленностьГруппы Расход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого СтрТЗ Из ТЗ Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Группа = СтрТЗ.Группа;
		Движение.Количество = СтрТЗ.Количество;
		Движение.Бюджет = СтрТЗ.Бюджет;
		Движение.Внебюджет = СтрТЗ.Внебюджет;
	КонецЦикла;
	
	ТЗ = РаботаДокументов.РасчетЧисленности(Абитуриенты, "зачисление");
	
	// регистр ЧисленностьГруппы Приход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого СтрТЗ Из ТЗ Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Группа = СтрТЗ.Группа;
		Движение.Количество = СтрТЗ.Количество;
		Движение.Бюджет = СтрТЗ.Бюджет;
		Движение.Внебюджет = СтрТЗ.Внебюджет;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры
