
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаАбитуриенты.ФИО;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Перевод;
	КонецЦикла;
	
	// перевод контингента в новую группу
	МассивУчета = Новый Соответствие;
	
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл 
		Если МассивУчета.Получить(ТекСтрокаАбитуриенты.СтараяГруппа) = 1 Тогда
			МассивУчета[ТекСтрокаАбитуриенты.СтараяГруппа] = МассивУчета[ТекСтрокаАбитуриенты.Группа] + 1;
		Иначе
			МассивУчета.Вставить(ТекСтрокаАбитуриенты.СтараяГруппа, 1);
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЧисленностьГруппы Расход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого Стр Из МассивУчета Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Группа = Стр.Ключ;
		Движение.Количество = Стр.Значение;
	КонецЦикла;
	
	МассивУчета.Очистить();
	
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл 
		Если МассивУчета.Получить(ТекСтрокаАбитуриенты.НоваяГруппа) = 1 Тогда
			МассивУчета[ТекСтрокаАбитуриенты.НоваяГруппа] = МассивУчета[ТекСтрокаАбитуриенты.Группа] + 1;
		Иначе
			МассивУчета.Вставить(ТекСтрокаАбитуриенты.НоваяГруппа, 1);
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЧисленностьГруппы Приход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого Стр Из МассивУчета Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Группа = Стр.Ключ;
		Движение.Количество = Стр.Значение;
	КонецЦикла;
КонецПроцедуры