
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НагрузкаГруппы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НагрузкаГруппы.Автор,
	|	НагрузкаГруппы.Группа,
	|	НагрузкаГруппы.Дата,
	|	НагрузкаГруппы.Курс,
	|	НагрузкаГруппы.Номер,
	|	НагрузкаГруппы.СуммаЧасов,
	|	НагрузкаГруппы.УчебныйГод,
	|	НагрузкаГруппы.Содержание.(
	|		НомерСтроки,
	|		Дисциплина,
	|		ВсегоЧасов,
	|		ВсегоЧасовЛекции,
	|		ВсегоЧасовПрактики,
	|		ВсегоЧасовАттестации,
	|		Преподаватель
	|	),
	|	НагрузкаГруппы.Детализация.(
	|		ЧислоНедель_I,
	|		ВсегоЧасов_I,
	|		ЧасыКонсультаций_I,
	|		ЧасыЛекций_I,
	|		ЧасыПрактики_I,
	|		ЧасыАттестации_I,
	|		ВидАттестации_I,
	|		ЧислоНедель_II,
	|		ВсегоЧасов_II,
	|		ЧасыЛекций_II,
	|		ЧасыПрактики_II,
	|		ЧасыКонсультаций_II,
	|		ЧасыАттестации_II,
	|		ВидАттестации_II
	|	)
	|ИЗ
	|	Документ.НагрузкаГруппы КАК НагрузкаГруппы
	|ГДЕ
	|	НагрузкаГруппы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСодержаниеШапка = Макет.ПолучитьОбласть("СодержаниеШапка");
	ОбластьСодержание = Макет.ПолучитьОбласть("Содержание");
	ОбластьДетализацияШапка = Макет.ПолучитьОбласть("ДетализацияШапка");
	ОбластьДетализация = Макет.ПолучитьОбласть("Детализация");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСодержаниеШапка);
		ВыборкаСодержание = Выборка.Содержание.Выбрать();
		Пока ВыборкаСодержание.Следующий() Цикл
			ОбластьСодержание.Параметры.Заполнить(ВыборкаСодержание);
			ТабДок.Вывести(ОбластьСодержание, ВыборкаСодержание.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьДетализацияШапка);
		ВыборкаДетализация = Выборка.Детализация.Выбрать();
		Пока ВыборкаДетализация.Следующий() Цикл
			ОбластьДетализация.Параметры.Заполнить(ВыборкаДетализация);
			ТабДок.Вывести(ОбластьДетализация, ВыборкаДетализация.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
