
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УчебныйПлан Приход
	Движения.УчебныйПлан.Записывать = Истина;
	Для Каждого ТекСтрокаДетализация Из Детализация Цикл
		ТекСтрокаСодержание = Содержание.Найти(ТекСтрокаДетализация.НомерСтроки,"НомерСтроки");
		
		// добавление первого полугодия
		Если ТекСтрокаДетализация.ВсегоЧасов_I = 0 Тогда
			Продолжить
		Иначе
			Движение1 = Движения.УчебныйПлан.Добавить();
			Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение1.Период = Дата;
			Движение1.Группа = Группа;
			Движение1.Курс = Курс;
			Движение1.Дисциплина = ТекСтрокаСодержание.Дисциплина;
			Движение1.РабочаяПрограмма = ТекСтрокаСодержание.РабочаяПрограмма;
			Движение1.Семестр = ТекСтрокаДетализация.Семестр_I;
			Движение1.ЧислоНедель = ТекСтрокаДетализация.ЧислоНедель_I;
			Движение1.ВсегоЧасов = ТекСтрокаДетализация.ВсегоЧасов_I;
			Движение1.ЧасыКонсультаций = ТекСтрокаДетализация.ЧасыКонсультаций_I;
			Движение1.ЧасыЛекций = ТекСтрокаДетализация.ЧасыЛекций_I;
			Движение1.ЧасыПрактики = ТекСтрокаДетализация.ЧасыПрактики_I;
			Движение1.ЧасыАттестации = ТекСтрокаДетализация.ЧасыАттестации_I;
			Движение1.ВидАттестации = ТекСтрокаДетализация.ВидАттестации_I;
			Движение1.Преподаватель = ТекСтрокаСодержание.Преподаватель;
		КонецЕсли;
		
		// добавление второго полугодия
		Если ТекСтрокаДетализация.ВсегоЧасов_II = 0 Тогда
			Продолжить
		Иначе
			Движение2 = Движения.УчебныйПлан.Добавить();
			Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение2.Период = Дата;
			Движение2.Группа = Группа;
			Движение2.Курс = Курс;
			Движение2.Дисциплина = ТекСтрокаСодержание.Дисциплина;
			Движение2.РабочаяПрограмма = ТекСтрокаСодержание.РабочаяПрограмма;
			Движение2.Семестр = ТекСтрокаДетализация.Семестр_II;
			Движение2.ЧислоНедель = ТекСтрокаДетализация.ЧислоНедель_II;
			Движение2.ВсегоЧасов = ТекСтрокаДетализация.ВсегоЧасов_II;
			Движение2.ЧасыЛекций = ТекСтрокаДетализация.ЧасыЛекций_II;
			Движение2.ЧасыПрактики = ТекСтрокаДетализация.ЧасыПрактики_II;
			Движение2.ЧасыКонсультаций = ТекСтрокаДетализация.ЧасыКонсультаций_II;
			Движение2.ЧасыАттестации = ТекСтрокаДетализация.ЧасыАттестации_II;
			Движение2.ВидАттестации = ТекСтрокаДетализация.ВидАттестации_II;
			Движение2.Преподаватель = ТекСтрокаСодержание.Преподаватель;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
