
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УчебныйПлан Приход
	Движения.УчебныйПлан.Записывать = Истина;
	Для Каждого ТекСтрокаДетализация Из Детализация Цикл
		ТекСтрокаСодержание = Содержание.Найти(ТекСтрокаДетализация.НомерСтроки,"НомерСтроки");
		Движение = Движения.УчебныйПлан.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Группа = Группа;
		Движение.Курс = Курс;
		Движение.Дисциплина = ТекСтрокаСодержание.Дисциплина;
		Движение.РабочаяПрограмма = ТекСтрокаСодержание.РабочаяПрограмма;
		Движение.ЧислоНедель_I = ТекСтрокаДетализация.ЧислоНедель_I;
		Движение.ВсегоЧасов_I = ТекСтрокаДетализация.ВсегоЧасов_I;
		Движение.ЧасыКонсультаций_I = ТекСтрокаДетализация.ЧасыКонсультаций_I;
		Движение.ЧасыЛекций_I = ТекСтрокаДетализация.ЧасыЛекций_I;
		Движение.ЧасыПрактики_I = ТекСтрокаДетализация.ЧасыПрактики_I;
		Движение.ЧасыАттестации_I = ТекСтрокаДетализация.ЧасыАттестации_I;
		Движение.ЧислоНедель_II = ТекСтрокаДетализация.ЧислоНедель_II;
		Движение.ВсегоЧасов_II = ТекСтрокаДетализация.ВсегоЧасов_II;
		Движение.ЧасыЛекций_II = ТекСтрокаДетализация.ЧасыЛекций_II;
		Движение.ЧасыПрактики_II = ТекСтрокаДетализация.ЧасыПрактики_II;
		Движение.ЧасыКонсультаций_II = ТекСтрокаДетализация.ЧасыКонсультаций_II;
		Движение.ЧасыАттестации_II = ТекСтрокаДетализация.ЧасыАттестации_II;
		Движение.ВидАттестации_I = ТекСтрокаДетализация.ВидАттестации_I;
		Движение.ВидАттестации_II = ТекСтрокаДетализация.ВидАттестации_II;
		Движение.Преподаватель = ТекСтрокаСодержание.Преподаватель;
	КонецЦикла;
КонецПроцедуры
