
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр УчебныйПлан Приход
	Движения.УчебныйПлан.Записывать = Истина;
	Для Каждого ТекСтрокаДетализация Из Детализация Цикл
		ТекСтрокаСодержание = Содержание.Найти(ТекСтрокаДетализация.НомерСтроки,"НомерСтроки");
		
		// добавление первого полугодия
		Если ТекСтрокаДетализация.ВсегоЧасов_I = 0 Тогда
			
		Иначе
			Движение1 = Движения.УчебныйПлан.Добавить();
			Движение1.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение1.Период = Дата;
			Движение1.Группа = Группа;
			Движение1.Курс = Курс;
			Движение1.Дисциплина = ТекСтрокаСодержание.Дисциплина;
			Движение1.РабочаяПрограмма = ТекСтрокаСодержание.РабочаяПрограмма;
			Движение1.Семестр = ТекСтрокаДетализация.Семестр_I;
			Движение1.ЧислоНедель = ТекСтрокаДетализация.ЧислоНедель_I;
			Движение1.ВсегоЧасов = ТекСтрокаДетализация.ВсегоЧасов_I;
			Движение1.ЧасыКонсультаций = ТекСтрокаДетализация.ЧасыКонсультаций_I;
			Движение1.ЧасыЛекций = ТекСтрокаДетализация.ЧасыЛекций_I;
			Движение1.ЧасыПрактики = ТекСтрокаДетализация.ЧасыПрактики_I;
			Движение1.ЧасыАттестации = ТекСтрокаДетализация.ЧасыАттестации_I;
			Движение1.ВидАттестации = ТекСтрокаДетализация.ВидАттестации_I;
			Движение1.Преподаватель = ТекСтрокаСодержание.Преподаватель;
			
			// запись курсовой или дипломной работы в новом документе
			Если ТекСтрокаДетализация.ВидАттестации_I = ПредопределенноеЗначение("Перечисление.ПромежуточнаяАттестация.КурсоваяРабота") Тогда
				ПроверкаЦелевыхРабот("Курсовая", ТекСтрокаДетализация.Семестр_I,  ТекСтрокаСодержание.Дисциплина, ТекСтрокаСодержание.Преподаватель);
			ИначеЕсли ТекСтрокаДетализация.ВидАттестации_I = ПредопределенноеЗначение("Перечисление.ПромежуточнаяАттестация.КвалификационныйЭкзамен") Тогда
				ПроверкаЦелевыхРабот("Диплом", , , );
			КонецЕсли;
		КонецЕсли;
		
		// добавление второго полугодия
		Если ТекСтрокаДетализация.ВсегоЧасов_II = 0 Тогда
			
		Иначе
			Движение2 = Движения.УчебныйПлан.Добавить();
			Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение2.Период = Дата;
			Движение2.Группа = Группа;
			Движение2.Курс = Курс;
			Движение2.Дисциплина = ТекСтрокаСодержание.Дисциплина;
			Движение2.РабочаяПрограмма = ТекСтрокаСодержание.РабочаяПрограмма;
			Движение2.Семестр = ТекСтрокаДетализация.Семестр_II;
			Движение2.ЧислоНедель = ТекСтрокаДетализация.ЧислоНедель_II;
			Движение2.ВсегоЧасов = ТекСтрокаДетализация.ВсегоЧасов_II;
			Движение2.ЧасыЛекций = ТекСтрокаДетализация.ЧасыЛекций_II;
			Движение2.ЧасыПрактики = ТекСтрокаДетализация.ЧасыПрактики_II;
			Движение2.ЧасыКонсультаций = ТекСтрокаДетализация.ЧасыКонсультаций_II;
			Движение2.ЧасыАттестации = ТекСтрокаДетализация.ЧасыАттестации_II;
			Движение2.ВидАттестации = ТекСтрокаДетализация.ВидАттестации_II;
			Движение2.Преподаватель = ТекСтрокаСодержание.Преподаватель;
			
			// запись курсовой или дипломной работы в новом документе
			Если ТекСтрокаДетализация.ВидАттестации_II = ПредопределенноеЗначение("Перечисление.ПромежуточнаяАттестация.КурсоваяРабота") Тогда
				ПроверкаЦелевыхРабот("Курсовая", ТекСтрокаДетализация.Семестр_II, ТекСтрокаСодержание.Дисциплина, ТекСтрокаСодержание.Преподаватель);
			ИначеЕсли ТекСтрокаДетализация.ВидАттестации_II = ПредопределенноеЗначение("Перечисление.ПромежуточнаяАттестация.КвалификационныйЭкзамен") Тогда
				ПроверкаЦелевыхРабот("Диплом", , , );
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПроверкаЦелевыхРабот(ВидРаботы, Семестр, Дисциплина, Преподаватель)
	Если ВидРаботы = "Курсовая" Тогда
		НовыйДокумент = Документы.НазначениеКурсовойРаботы.СоздатьДокумент();
		
		НовыйДокумент.Дата = Дата;
		НовыйДокумент.Группа = Группа;
		НовыйДокумент.Семестр = Семестр;
		НовыйДокумент.Дисциплина = Дисциплина;
		НовыйДокумент.Основание = Ссылка;
		НовыйДокумент.Руководитель = Преподаватель;
		
		Обучающиеся = РегистрыСведений.АктуальностьКонтингента.СрезПоследних(Дата);
		Для Каждого Обучающийся Из Обучающиеся Цикл
			Если Обучающийся.Обучается = Истина И Обучающийся.Группа = Группа Тогда
				НовыйДокументСтрока = НовыйДокумент.Обучающиеся.Добавить();
				НовыйДокументСтрока.ФИО = Обучающийся.Обучающийся;
			КонецЕсли;
		КонецЦикла;
		
		НовыйДокумент.Записать();
		
	ИначеЕсли ВидРаботы = "Диплом" Тогда
		НовыйДокумент = Документы.НазначениеДипломнойРаботы.СоздатьДокумент();
		
		НовыйДокумент.Дата = Дата;
		НовыйДокумент.Группа = Группа;
		НовыйДокумент.Основание = Ссылка;
		
		Обучающиеся = РегистрыСведений.АктуальностьКонтингента.СрезПоследних(Дата);
		Для Каждого Обучающийся Из Обучающиеся Цикл
			Если Обучающийся.Обучается = Истина И Обучающийся.Группа = Группа Тогда
				НовыйДокументСтрока = НовыйДокумент.Обучающиеся.Добавить();
				НовыйДокументСтрока.ФИО = Обучающийся.Обучающийся;
			КонецЕсли;
		КонецЦикла;
		
		НовыйДокумент.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НазначениеКурсовойРаботы.Ссылка КАК Ссылка,
	|	НазначениеКурсовойРаботы.Основание КАК Основание
	|ИЗ
	|	Документ.НазначениеКурсовойРаботы КАК НазначениеКурсовойРаботы
	|ГДЕ
	|	НазначениеКурсовойРаботы.Основание = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Документ = Выборка.Ссылка.ПолучитьОбъект();
		Документ.ПометкаУдаления = Истина;
		Документ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
КонецПроцедуры