
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.НазначениеКурсовойРаботы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначениеКурсовойРаботы.Автор,
	|	НазначениеКурсовойРаботы.Группа,
	|	НазначениеКурсовойРаботы.Дата,
	|	НазначениеКурсовойРаботы.ДатаЗащиты,
	|	НазначениеКурсовойРаботы.Дисциплина,
	|	НазначениеКурсовойРаботы.Номер,
	|	НазначениеКурсовойРаботы.Руководитель,
	|	НазначениеКурсовойРаботы.Обучающиеся.(
	|		НомерСтроки,
	|		ФИО,
	|		Тема,
	|		НаПримере
	|	)
	|ИЗ
	|	Документ.НазначениеКурсовойРаботы КАК НазначениеКурсовойРаботы
	|ГДЕ
	|	НазначениеКурсовойРаботы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОбучающиесяШапка = Макет.ПолучитьОбласть("ОбучающиесяШапка");
	ОбластьОбучающиеся = Макет.ПолучитьОбласть("Обучающиеся");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОбучающиесяШапка);
		ВыборкаОбучающиеся = Выборка.Обучающиеся.Выбрать();
		Пока ВыборкаОбучающиеся.Следующий() Цикл
			ОбластьОбучающиеся.Параметры.Заполнить(ВыборкаОбучающиеся);
			ТабДок.Вывести(ОбластьОбучающиеся, ВыборкаОбучающиеся.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
