// Проверка студента на наличии в другой группе
Функция ПроверкаСтудентаВГруппе(СтрокаСтудента) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	АктуальностьКонтингентаСрезПоследних.Обучающийся КАК Обучающийся,
	|	АктуальностьКонтингентаСрезПоследних.Группа КАК Группа,
	|	АктуальностьКонтингентаСрезПоследних.Обучается КАК Обучается
	|ИЗ
	|	РегистрСведений.АктуальностьКонтингента.СрезПоследних КАК АктуальностьКонтингентаСрезПоследних
	|ГДЕ
	|	АктуальностьКонтингентаСрезПоследних.Обучающийся = &ФИО");
	
	Запрос.УстановитьПараметр("ФИО", СтрокаСтудента);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Если Результат.Обучается = Истина Тогда
			Сообщить("Студент " + СтрокаСтудента + " уже в группе " + Результат.Группа.Наименование);
			Отказ = Истина
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
КонецФункции

// Подсчитывает количество обучающихся при зачислении, переводе или отчислении
//
// Параметры:
//	Абитуриенты - ТабличнаяЧасть - табличная часть документа со списком обучающихся и групп.
//	Режим - выбор вида операции (обычный, отчисление, зачисление).
//		обычный - простой подсчет обучающихся по группе;
//		отчисление - подсчет обучающихся при переводе (убрать из группы);
//		зачисление - подсчет обучающихся при переводе (добавить в группу).
//
// Возвращаемое значение
//	ТаблицаЗначений - таблица значений с группой, общей численностью и численностью бюджетников и внебюджетников
//
// Пример:
//	ТЗ = РаботаДокументов.РасчетЧисленности(Объект.Абитуриенты, "зачисление");
//
Функция РасчетЧисленности(Абитуриенты, Режим) Экспорт
	// подсчет группы с уточнением количества бюджета и внебюджета
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Группа");
	ТЗ.Колонки.Добавить("Количество");
	ТЗ.Колонки.Добавить("Бюджет");
	ТЗ.Колонки.Добавить("Внебюджет");
	
	// простой подсчет обучающихся
	Если Режим = "обычный" Тогда
		// проход по каждой строка табличной части
		Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
			// поиск группы в таблице значений
			Индекс = ТЗ.Найти(ТекСтрокаАбитуриенты.Группа, "Группа");
			// если группа найдена
			Если Индекс = 1 Тогда
				// выгрузка строки таблицы значений и добавление обучающегося
				Строка = ТЗ.Получить(Индекс);
				Строка.Количество = Строка.Количество + 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = Строка.Внебюджет + 1;
				Иначе
					Строка.Бюджет = Строка.Бюджет + 1;
				КонецЕсли;
				
			// если группа не найдена
			Иначе
				// добавление новой строки с добавлением студента
				Строка = ТЗ.Добавить();
				Строка.Группа = ТекСтрокаАбитуриенты.Группа;
				Строка.Количество = 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = 1;
					Строка.Бюджет = 0;
				Иначе
					Строка.Внебюджет = 0;
					Строка.Бюджет = 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Возврат ТЗ;
		
	// подсчет обучающихся для удаления при переводе
	ИначеЕсли Режим = "отчисление" Тогда
		// проход по каждой строка табличной части
		Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
			// поиск группы в таблице значений
			Индекс = ТЗ.Найти(ТекСтрокаАбитуриенты.СтараяГруппа, "Группа");
			// если группа найдена
			Если Индекс = 1 Тогда
				// выгрузка строки таблицы значений и добавление обучающегося
				Строка = ТЗ.Получить(Индекс);
				Строка.Количество = Строка.Количество + 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = Строка.Внебюджет + 1;
				Иначе
					Строка.Бюджет = Строка.Бюджет + 1;
				КонецЕсли;
				
			// если группа не найдена
			Иначе
				// добавление новой строки с добавлением студента
				Строка = ТЗ.Добавить();
				Строка.Группа = ТекСтрокаАбитуриенты.СтараяГруппа;
				Строка.Количество = 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = 1;
					Строка.Бюджет = 0;
				Иначе
					Строка.Внебюджет = 0;
					Строка.Бюджет = 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Возврат ТЗ;
		
	// подсчет обучающихся для добавления при переводе
	ИначеЕсли Режим = "зачисление" Тогда
		// проход по каждой строка табличной части
		Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
			// поиск группы в таблице значений
			Индекс = ТЗ.Найти(ТекСтрокаАбитуриенты.НоваяГруппа, "Группа");
			// если группа найдена
			Если Индекс = 1 Тогда
				// выгрузка строки таблицы значений и добавление обучающегося
				Строка = ТЗ.Получить(Индекс);
				Строка.Количество = Строка.Количество + 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = Строка.Внебюджет + 1;
				Иначе
					Строка.Бюджет = Строка.Бюджет + 1;
				КонецЕсли;
				
			// если группа не найдена
			Иначе
				// добавление новой строки с добавлением студента
				Строка = ТЗ.Добавить();
				Строка.Группа = ТекСтрокаАбитуриенты.НоваяГруппа;
				Строка.Количество = 1;
				
				// проверка на бюджет и внебюджет
				Если ТекСтрокаАбитуриенты.ФИО.Внебюджет = Истина Тогда
					Строка.Внебюджет = 1;
					Строка.Бюджет = 0;
				Иначе
					Строка.Внебюджет = 0;
					Строка.Бюджет = 1;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Возврат ТЗ;
		
	КонецЕсли;
КонецФункции