
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПротоколДипломнойРаботы.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПротоколДипломнойРаботы.Автор,
	|	ПротоколДипломнойРаботы.Группа,
	|	ПротоколДипломнойРаботы.Дата,
	|	ПротоколДипломнойРаботы.ДатаЗащиты,
	|	ПротоколДипломнойРаботы.НаПримере,
	|	ПротоколДипломнойРаботы.Номер,
	|	ПротоколДипломнойРаботы.Обучающийся,
	|	ПротоколДипломнойРаботы.Оценка,
	|	ПротоколДипломнойРаботы.Руководитель,
	|	ПротоколДипломнойРаботы.Тема,
	|	ПротоколДипломнойРаботы.ОтзывКомиссии.(
	|		НомерСтроки,
	|		ФИОЧленаКомиссии,
	|		Отзыв
	|	)
	|ИЗ
	|	Документ.ПротоколДипломнойРаботы КАК ПротоколДипломнойРаботы
	|ГДЕ
	|	ПротоколДипломнойРаботы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОтзывКомиссииШапка = Макет.ПолучитьОбласть("ОтзывКомиссииШапка");
	ОбластьОтзывКомиссии = Макет.ПолучитьОбласть("ОтзывКомиссии");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОтзывКомиссииШапка);
		ВыборкаОтзывКомиссии = Выборка.ОтзывКомиссии.Выбрать();
		Пока ВыборкаОтзывКомиссии.Следующий() Цикл
			ОбластьОтзывКомиссии.Параметры.Заполнить(ВыборкаОтзывКомиссии);
			ТабДок.Вывести(ОбластьОтзывКомиссии, ВыборкаОтзывКомиссии.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
