
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр ИтоговыеОценки
	Движения.ИтоговыеОценки.Записывать = Истина;
	Движение = Движения.ИтоговыеОценки.Добавить();
	Движение.Группа = Группа;
	Движение.Дисциплина = Справочники.Дисциплины.КвалификационнаяРабота;
	Движение.Обучающийся = Обучающийся;
	Движение.Оценка = Оценка;
	Движение.ПромежуточнаяАттестация = Перечисления.ПромежуточнаяАттестация.КвалификационныйЭкзамен;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры