
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаАбитуриенты.ФИО;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Отчисление;
		Движение.Причина = ТекСтрокаАбитуриенты.Причина;
	КонецЦикла;
	
	МассивУчета = Новый Соответствие;
	
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл 
		Если МассивУчета.Получить(ТекСтрокаАбитуриенты.Группа) = 1 Тогда
			МассивУчета[ТекСтрокаАбитуриенты.Группа] = МассивУчета[ТекСтрокаАбитуриенты.Группа] + 1;
		Иначе
			МассивУчета.Вставить(ТекСтрокаАбитуриенты.Группа, 1);
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЧисленностьГруппы Расход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого Стр Из МассивУчета Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Группа = Стр.Ключ;
		Движение.Количество = Стр.Значение;
	КонецЦикла;
КонецПроцедуры
