
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Обучающийся = ТекСтрокаАбитуриенты.ФИО;
		Движение.Обучается = Ложь;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Отчисление;
		Движение.Причина = ТекСтрокаАбитуриенты.Причина;
	КонецЦикла;
	
	// регистр АктивныйКонтингент
	Движения.АктивныйКонтингент.Записывать = Истина;
	Для Каждого ТекСтрокаАбитуриенты Из Абитуриенты Цикл
		Движение = Движения.АктивныйКонтингент.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Обучающийся = ТекСтрокаАбитуриенты.ФИО;
		Движение.Обучаются = 1;
	КонецЦикла;
	
	ТЗ = РаботаДокументов.РасчетЧисленности(Абитуриенты, "обычный");
	
	// регистр ЧисленностьГруппы Расход
	Движения.ЧисленностьГруппы.Записывать = Истина;
	Для Каждого СтрТЗ Из ТЗ Цикл
		Движение = Движения.ЧисленностьГруппы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Группа = СтрТЗ.Группа;
		Движение.Количество = СтрТЗ.Количество;
		Движение.Бюджет = СтрТЗ.Бюджет;
		Движение.Внебюджет = СтрТЗ.Внебюджет;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры
