&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Семестр) Тогда
		Элементы.Семестр.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчебныйПланПриИзменении(Элемент)
	ОтборПоГоду = УстановитьОтборСеместра();
	
	мПараметр = Новый Массив();
	Параметр = Новый ПараметрВыбора("Отбор.Владелец", ОтборПоГоду);
	мПараметр.Добавить(Параметр);
	
	Элементы.Семестр.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметр);
	
	Элементы.Семестр.ТолькоПросмотр = Ложь;
	//Конфигурация не понимает, какие дисциплины в данном семестре группы
	//(из учебной программы), поэтому выводиться весь список дисциплин
КонецПроцедуры

Функция УстановитьОтборСеместра()
	Результат = Объект.УчебныйПлан.УчебныйГод;
	
	Возврат Результат;
КонецФункции