
&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ДинамическийСписокЖурнал.Параметры.УстановитьЗначениеПараметра("Группа", Группа);
	ЗаполнитьЖурнал();
КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	ДинамическийСписокЖурнал.Параметры.УстановитьЗначениеПараметра("Дисциплина", Дисциплина);
	ЗаполнитьЖурнал();
КонецПроцедуры

Процедура ЗаполнитьЖурнал()
	РеквизитыТаблицы = ПолучитьРеквизиты("ЖурналУспеваемости");
	Если Не РеквизитыТаблицы = 0 Тогда
		УдаляемыеРеквизиты = Новый Массив;
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			УдаляемыеРеквизиты.Добавить("ЖурналУспеваемости." + Реквизит.Имя);
			Элементы.Удалить(Элементы[Реквизит.Имя]);
		КонецЦикла;
		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Группа) И ЗначениеЗаполнено(Дисциплина) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	АктуальностьКонтингентаСрезПоследних.Группа КАК Группа,
		|	ОценкиСтудентов.Дисциплина КАК Дисциплина,
		|	ОценкиСтудентов.ДатаЗанятия КАК ДатаЗанятия,
		|	ОценкиСтудентов.Обучающийся КАК Обучающийся,
		|	ОценкиСтудентов.Отметка КАК Отметка
		|ИЗ
		|	РегистрСведений.ОценкиСтудентов КАК ОценкиСтудентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальностьКонтингента.СрезПоследних КАК АктуальностьКонтингентаСрезПоследних
		|		ПО ОценкиСтудентов.Обучающийся = АктуальностьКонтингентаСрезПоследних.Обучающийся
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасписаниеНаДату КАК РасписаниеНаДату
		|		ПО ОценкиСтудентов.ДатаЗанятия = РасписаниеНаДату.ДатаЗанятия
		|ГДЕ
		|	АктуальностьКонтингентаСрезПоследних.Группа = &Группа
		|	И ОценкиСтудентов.Дисциплина = &Дисциплина");
			
		Запрос.УстановитьПараметр("Группа", Группа);
		Запрос.УстановитьПараметр("Дисциплина", Дисциплина);

		ОценкиСтудентов = Запрос.Выполнить().Выгрузить();
		
		ТаблицаСоответствий = РаботаДокументов.ПолучитьИдентификаторыДанных(
						ОценкиСтудентов,
						"ДатаЗанятия");
						
		ОценкиСтудентов_Служебная.Загрузить(ТаблицаСоответствий);
		Для Каждого Строка Из ОценкиСтудентов_Служебная Цикл
			Строка.Заголовок = Строка.ДатаЗанятия;
			Строка.Тип = Новый ОписаниеТипов("СправочникСсылка.Отметки");
		КонецЦикла;

		КроссТаблица = РаботаДокументов.ТрансформироватьДанныеВКроссТаблицу(
						ОценкиСтудентов.Выгрузить(),
						ОценкиСтудентов_Служебная,
						"Обучающийся",
						"Отметка");
		
		//
		МассивРеквизитов = Новый Массив;
		Для Каждого Колонка Из КроссТаблица.Колонки Цикл
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя,
						Колонка.ТипЗначения, "ЖурналУспеваемости",
						Колонка.Заголовок,
						Истина));
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		
		Для Каждого Колонка Из КроссТаблица.Колонки Цикл
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.ЖурналУспеваемости);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ЖурналУспеваемости." + Колонка.Имя;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(КроссТаблица, "ЖурналУспеваемости");
		
	КонецЕсли;
КонецПроцедуры