&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Семестр) Тогда
		Элементы.Семестр.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчебныйПланПриИзменении(Элемент)
	ОтборПоГоду = УстановитьОтборСеместра();
	
	мПараметр = Новый Массив();
	Параметр = Новый ПараметрВыбора("Отбор.Владелец", ОтборПоГоду);
	мПараметр.Добавить(Параметр);
	
	Элементы.Семестр.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметр);
	
	Элементы.Семестр.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаСервере
Функция УстановитьОтборСеместра()
	Результат = Объект.УчебныйПлан.УчебныйГод;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ДатаРасписанияПриИзменении(Элемент)
	ПроверкаДаты();
КонецПроцедуры

&НаСервере
Процедура ПроверкаДаты()
	ТекущаяДата = Объект.ДатаРасписания;
	ДатаНачала = Объект.Семестр.ДатаНачала;
	ДатаОкончания = Объект.Семестр.ДатаОкончания;
	
	Если ТекущаяДата <= ДатаНачала ИЛИ ТекущаяДата >= ДатаОкончания Тогда
		Сообщить("Нельзя выставить дату, не входящую в состав выбранного семестра!");
		Объект.ДатаРасписания = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеДисциплинаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДляФормы = Новый Структура("Группа, Семестр", Объект.Группа, Объект.Семестр);
	Форма = ПолучитьФорму("Справочник.Дисциплины.Форма.ФормаВыбораВРасписании", ПараметрыДляФормы, Элементы.РасписаниеДисциплина);
	Форма.Открыть();
КонецПроцедуры

