
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СоставлениеРасписания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставлениеРасписания.Автор,
	|	СоставлениеРасписания.Группа,
	|	СоставлениеРасписания.Дата,
	|	СоставлениеРасписания.ДатаРасписания,
	|	СоставлениеРасписания.Номер,
	|	СоставлениеРасписания.Расписание.(
	|		НомерСтроки,
	|		Занятие,
	|		Дисциплина,
	|		Кабинет,
	|		Преподаватель
	|	)
	|ИЗ
	|	Документ.СоставлениеРасписания КАК СоставлениеРасписания
	|ГДЕ
	|	СоставлениеРасписания.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРасписаниеШапка = Макет.ПолучитьОбласть("РасписаниеШапка");
	ОбластьРасписание = Макет.ПолучитьОбласть("Расписание");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРасписаниеШапка);
		ВыборкаРасписание = Выборка.Расписание.Выбрать();
		Пока ВыборкаРасписание.Следующий() Цикл
			ОбластьРасписание.Параметры.Заполнить(ВыборкаРасписание);
			ТабДок.Вывести(ОбластьРасписание, ВыборкаРасписание.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
