
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр РасписаниеНаДату
	Движения.РасписаниеНаДату.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		/// Проверка на существование занятий в регистре
		СтрокаДисциплины = УчебныйПлан.Содержание.Найти(ТекСтрокаРасписание.Дисциплина, "Дисциплина");
		РабочаяПрограмма = СтрокаДисциплины.РабочаяПрограмма.ТематическийПлан;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасписаниеНаДату.Регистратор КАК Регистратор,
		|	РасписаниеНаДату.НомерСтроки КАК НомерСтроки,
		|	РасписаниеНаДату.Активность КАК Активность,
		|	РасписаниеНаДату.Группа КАК Группа,
		|	РасписаниеНаДату.Дисциплина КАК Дисциплина,
		|	РасписаниеНаДату.Занятие КАК Занятие,
		|	РасписаниеНаДату.Кабинет КАК Кабинет,
		|	РасписаниеНаДату.Преподаватель КАК Преподаватель,
		|	РасписаниеНаДату.ДатаЗанятия КАК ДатаЗанятия,
		|	РасписаниеНаДату.Семестр КАК Семестр,
		|	РасписаниеНаДату.ЗанятиеПоРП КАК ЗанятиеПоРП,
		|	РасписаниеНаДату.Тема КАК Тема,
		|	РасписаниеНаДату.Содержание КАК Содержание,
		|	РасписаниеНаДату.ДомашнееЗадание КАК ДомашнееЗадание,
		|	РасписаниеНаДату.Литература КАК Литература,
		|	РасписаниеНаДату.ФормаОрганизации КАК ФормаОрганизации,
		|	РасписаниеНаДату.ПромежуточнаяАттестация КАК ПромежуточнаяАттестация
		|ИЗ
		|	РегистрСведений.РасписаниеНаДату КАК РасписаниеНаДату
		|ГДЕ
		|	РасписаниеНаДату.Группа = &Группа
		|	И РасписаниеНаДату.Дисциплина = &Дисциплина
		|	И РасписаниеНаДату.Семестр = &Семестр");
		
		Запрос.УстановитьПараметр("Группа", Группа);
		Запрос.УстановитьПараметр("Дисциплина", ТекСтрокаРасписание.Дисциплина);
		Запрос.УстановитьПараметр("Семестр", Семестр);
		
		МенеджерРегистра = Запрос.Выполнить().Выгрузить();
		
		// Проверка на существующий элемент журнала по документу
		// Если нет - новая запись в регистре
		Если МенеджерРегистра.Количество() = 0 Тогда
			Движение = Движения.РасписаниеНаДату.Добавить();
			Движение.Период = Дата;
			Движение.Группа = Группа;
			Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
			Движение.Занятие = ТекСтрокаРасписание.Занятие;
			Движение.ДатаЗанятия = ДатаРасписания;
			Движение.Семестр = Семестр;
			Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
			Движение.Кабинет = ТекСтрокаРасписание.Кабинет;
			
			СтрокаРабочейПрограммы = РабочаяПрограмма.Найти(1, "НомерСтроки");
			
			Движение.ЗанятиеПоРП = СтрокаРабочейПрограммы.НомерСтроки;
			Движение.Тема = СтрокаРабочейПрограммы.Тема;
			Движение.Содержание = СтрокаРабочейПрограммы.Содержание;
			Движение.ДомашнееЗадание = СтрокаРабочейПрограммы.ДомашнееЗадание;
			Движение.Литература = СтрокаРабочейПрограммы.Литература;
			Движение.ФормаОрганизации = СтрокаРабочейПрограммы.ФормаОрганизации;
			Движение.ПромежуточнаяАттестация = СтрокаРабочейПрограммы.ПромежуточнаяАттестация;
			
			Движения.РасписаниеНаДату.Записать();
			
		// Если есть и есть изменения - обновить
		// Добавить проверку на соответствие регистра
	ИначеЕсли МенеджерРегистра.Количество() <> 0 Тогда
			СтрокаРабочейПрограммы = РабочаяПрограмма.Найти(МенеджерРегистра.Количество() + 1, "НомерСтроки");
			
			Движение = Движения.РасписаниеНаДату.Добавить();
			Движение.Период = Дата;
			Движение.Группа = Группа;
			Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
			Движение.Занятие = ТекСтрокаРасписание.Занятие;
			Движение.ДатаЗанятия = ДатаРасписания;
			Движение.Семестр = Семестр;
			Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
			Движение.Кабинет = ТекСтрокаРасписание.Кабинет;
			
			Движение.ЗанятиеПоРП = СтрокаРабочейПрограммы.НомерСтроки;
			Движение.Тема = СтрокаРабочейПрограммы.Тема;
			Движение.Содержание = СтрокаРабочейПрограммы.Содержание;
			Движение.ДомашнееЗадание = СтрокаРабочейПрограммы.ДомашнееЗадание;
			Движение.Литература = СтрокаРабочейПрограммы.Литература;
			Движение.ФормаОрганизации = СтрокаРабочейПрограммы.ФормаОрганизации;
			Движение.ПромежуточнаяАттестация = СтрокаРабочейПрограммы.ПромежуточнаяАттестация;
			
			Движения.РасписаниеНаДату.Записать();
		КонецЕсли;
		
		ГенерацияЖурналов();
		// Необходимо под каждую выбранную дисциплину в табличной части
		// создавать документ с заполнением следующих реквизитов:
		//
		// Из корня: Группа, Семестр, ДатаРасписания, Основание
		// Из строки: Дисциплина, Кабинет, Преподаватель
		// Из новосозданной строки регистра сведений: Тема, Занятие, Д/з, Литература
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ГенерацияЖурналов()
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
