
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр РасписаниеНаДату
	Движения.РасписаниеНаДату.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		/// Проверка на существование занятий в регистре
		СтрокаДисциплины = УчебныйПлан.Содержание.Найти(ТекСтрокаРасписание.Дисциплина, "Дисциплина");
		РабочаяПрограмма = СтрокаДисциплины.РабочаяПрограмма.ТематическийПлан;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	РасписаниеНаДату.Регистратор КАК Регистратор,
		|	РасписаниеНаДату.НомерСтроки КАК НомерСтроки,
		|	РасписаниеНаДату.Активность КАК Активность,
		|	РасписаниеНаДату.Группа КАК Группа,
		|	РасписаниеНаДату.Дисциплина КАК Дисциплина,
		|	РасписаниеНаДату.Занятие КАК Занятие,
		|	РасписаниеНаДату.Кабинет КАК Кабинет,
		|	РасписаниеНаДату.Преподаватель КАК Преподаватель,
		|	РасписаниеНаДату.ДатаЗанятия КАК ДатаЗанятия,
		|	РасписаниеНаДату.Семестр КАК Семестр,
		|	РасписаниеНаДату.ЗанятиеПоРП КАК ЗанятиеПоРП,
		|	РасписаниеНаДату.Тема КАК Тема,
		|	РасписаниеНаДату.Содержание КАК Содержание,
		|	РасписаниеНаДату.ДомашнееЗадание КАК ДомашнееЗадание,
		|	РасписаниеНаДату.Литература КАК Литература,
		|	РасписаниеНаДату.ФормаОрганизации КАК ФормаОрганизации,
		|	РасписаниеНаДату.ПромежуточнаяАттестация КАК ПромежуточнаяАттестация
		|ИЗ
		|	РегистрСведений.РасписаниеНаДату КАК РасписаниеНаДату
		|ГДЕ
		|	РасписаниеНаДату.Группа = &Группа
		|	И РасписаниеНаДату.Дисциплина = &Дисциплина
		|	И РасписаниеНаДату.Семестр = &Семестр");
		
		Запрос.УстановитьПараметр("Группа", Группа);
		Запрос.УстановитьПараметр("Дисциплина", ТекСтрокаРасписание.Дисциплина);
		Запрос.УстановитьПараметр("Семестр", Семестр);
		
		МенеджерРегистра = Запрос.Выполнить().Выгрузить();
		
		// Проверка на существующий элемент журнала по документу
		// Если нет - новая запись в регистре
		Если МенеджерРегистра.Количество() = 0 Тогда
			Движение = Движения.РасписаниеНаДату.Добавить();
			Движение.Период = Дата;
			Движение.Группа = Группа;
			Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
			Движение.Занятие = ТекСтрокаРасписание.Занятие;
			Движение.ДатаЗанятия = ДатаРасписания;
			Движение.Семестр = Семестр;
			Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
			Движение.Кабинет = ТекСтрокаРасписание.Кабинет;
			
			СтрокаРабочейПрограммы = РабочаяПрограмма.Найти(1, "НомерСтроки");
			
			Движение.ЗанятиеПоРП = СтрокаРабочейПрограммы.НомерСтроки;
			Движение.Тема = СтрокаРабочейПрограммы.Тема;
			Движение.Содержание = СтрокаРабочейПрограммы.Содержание;
			Движение.ДомашнееЗадание = СтрокаРабочейПрограммы.ДомашнееЗадание;
			Движение.Литература = СтрокаРабочейПрограммы.Литература;
			Движение.ФормаОрганизации = СтрокаРабочейПрограммы.ФормаОрганизации;
			Движение.ПромежуточнаяАттестация = СтрокаРабочейПрограммы.ПромежуточнаяАттестация;
			
			Движения.РасписаниеНаДату.Записать();
			
		ИначеЕсли МенеджерРегистра.Количество() <> 0 Тогда
			СтрокаРабочейПрограммы = РабочаяПрограмма.Найти(МенеджерРегистра.Количество() + 1, "НомерСтроки");
			
			Движение = Движения.РасписаниеНаДату.Добавить();
			Движение.Период = Дата;
			Движение.Группа = Группа;
			Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
			Движение.Занятие = ТекСтрокаРасписание.Занятие;
			Движение.ДатаЗанятия = ДатаРасписания;
			Движение.Семестр = Семестр;
			Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
			Движение.Кабинет = ТекСтрокаРасписание.Кабинет;
			
			Движение.ЗанятиеПоРП = СтрокаРабочейПрограммы.НомерСтроки;
			Движение.Тема = СтрокаРабочейПрограммы.Тема;
			Движение.Содержание = СтрокаРабочейПрограммы.Содержание;
			Движение.ДомашнееЗадание = СтрокаРабочейПрограммы.ДомашнееЗадание;
			Движение.Литература = СтрокаРабочейПрограммы.Литература;
			Движение.ФормаОрганизации = СтрокаРабочейПрограммы.ФормаОрганизации;
			Движение.ПромежуточнаяАттестация = СтрокаРабочейПрограммы.ПромежуточнаяАттестация;
			
			Движения.РасписаниеНаДату.Записать();
		КонецЕсли;
		
		РезультатСоздания = ГенерацияЖурналов(ТекСтрокаРасписание, СтрокаРабочейПрограммы);
		Если РезультатСоздания[0] Тогда
			Движение.ЖурналСоздан = Истина;
			Движение.СсылкаНаЖурнал = РезультатСоздания[1];
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

&НаСервере
Функция ГенерацияЖурналов(ТекСтрокаРасписание, СтрокаРабочейПрограммы)
	// Необходимо под каждую выбранную дисциплину в табличной части
	// создавать документ с заполнением следующих реквизитов:
	//
	// Из корня: Группа, Семестр, ДатаРасписания, Основание
	// Из строки: Дисциплина, Кабинет, Преподаватель
	// Из новосозданной строки регистра сведений: Тема, Занятие, Д/з, Литература
	НовыйДокумент = Документы.ПроведениеЗанятия.СоздатьДокумент();
	
	НовыйДокумент.Дата = Дата;
	НовыйДокумент.Группа = Группа;
	НовыйДокумент.Семестр = Семестр;
	НовыйДокумент.ДатаРасписания = ДатаРасписания;
	НовыйДокумент.Основание = Ссылка;
	
	НовыйДокумент.Дисциплина = ТекСтрокаРасписание.Дисциплина;
	НовыйДокумент.Кабинет = ТекСтрокаРасписание.Кабинет;
	НовыйДокумент.Преподаватель = ТекСтрокаРасписание.Преподаватель;
	
	НовыйДокумент.Тема = СтрокаРабочейПрограммы.Тема;
	НовыйДокумент.Занятие = СтрокаРабочейПрограммы.Содержание;
	НовыйДокумент.ДомашнееЗанятие = СтрокаРабочейПрограммы.ДомашнееЗадание;
	НовыйДокумент.Литература = СтрокаРабочейПрограммы.Литература;
	
	Обучающиеся = РегистрыСведений.АктуальностьКонтингента.СрезПоследних(Дата);
	Для Каждого Обучающийся Из Обучающиеся Цикл
		Если Обучающийся.Обучается = Истина И Обучающийся.Группа = Группа Тогда
			НовыйДокументСтрока = НовыйДокумент.ИтогиПроведения.Добавить();
			НовыйДокументСтрока.Обучающийся = Обучающийся.Обучающийся;
		КонецЕсли;
	КонецЦикла;
	
	НовыйДокумент.Записать();
	
	Результат = Новый Массив;
	Результат.Добавить(Истина);
	Результат.Добавить(НовыйДокумент.Ссылка);
	
	Возврат Результат;
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
