
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр РасписаниеНаДату
	Движения.РасписаниеНаДату.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.РасписаниеНаДату.Добавить();
		Движение.Период = Дата;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаРасписание.Дисциплина;
		Движение.Урок = ТекСтрокаРасписание.Занятие;
		Движение.Дата = ДатаРасписания;
		Движение.Преподаватель = ТекСтрокаРасписание.Преподаватель;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

