// Первоем открытие обработки
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Преподаватель = Пользователи.ОпределитьКадры();
	ДинамическийСписокЗанятий.Параметры.УстановитьЗначениеПараметра("Преподаватель", Преподаватель);
	
	Календарь = ТекущаяДата();
	ОбновитьПериодОтображения(ТекущаяДата());
	ЗаполнитьРасписание();
КонецПроцедуры

// Выбор недели на расписании
&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	ОбновитьПериодОтображения(Календарь);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодОтображения(Дата)
	Начало = НачалоНедели(Дата);
	Конец = КонецНедели(Дата);
	
	Расписание.ТекущиеПериодыОтображения.Очистить();
	Расписание.ТекущиеПериодыОтображения.Добавить(Начало, Конец);
	
	ДинамическийСписокЗанятий.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Начало);
	ДинамическийСписокЗанятий.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Конец);
КонецПроцедуры

// Обновление расписания
&НаСервере
Процедура ЗаполнитьРасписание()
	Расписание.Элементы.Очистить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасписаниеНаДату.Регистратор КАК Регистратор,
	|	РасписаниеНаДату.НомерСтроки КАК НомерСтроки,
	|	РасписаниеНаДату.Группа КАК Группа,
	|	РасписаниеНаДату.Дисциплина КАК Дисциплина,
	|	РасписаниеНаДату.Занятие КАК Занятие,
	|	РасписаниеНаДату.Преподаватель КАК Преподаватель,
	|	РасписаниеНаДату.ДатаЗанятия КАК Дата,
	|	РасписаниеНаДату.ЖурналЗаполнен КАК ЖурналЗаполнен,
	|	РасписаниеНаДату.СсылкаНаЖурнал КАК СсылкаНаЖурнал
	|ИЗ
	|	РегистрСведений.РасписаниеНаДату КАК РасписаниеНаДату
	|ГДЕ
	|	РасписаниеНаДату.Преподаватель = &Преподаватель
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	НомерСтроки");
	
	Запрос.УстановитьПараметр("Преподаватель", Преподаватель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВремени = Новый Массив(3);
	МассивВремени[0] = ТекущаяДата();
	
	// Обновление планировщика
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Занятие", Выборка.Занятие);
		ВремяЗанятия = РегистрыСведений.ВремяУрока.ПолучитьПоследнее(Выборка.Дата, Отбор);
		
		МассивВремени[1] = НачалоДня(Выборка.Дата) + Час(ВремяЗанятия.НачалоЗанятия) * 60 * 60 + Минута(ВремяЗанятия.НачалоЗанятия) * 60;
		МассивВремени[2] = НачалоДня(Выборка.Дата) + Час(ВремяЗанятия.ОкончаниеЗанятия) * 60 * 60 + Минута(ВремяЗанятия.ОкончаниеЗанятия) * 60;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Выборка.Дисциплина);
		
		Если Не Выборка.ЖурналЗаполнен Тогда
			МассивСтрок.Добавить(Символы.ПС);
			МассивСтрок.Добавить("Заполните журнал");
		КонецЕсли;
		
		НовыйЭлемент = Расписание.Элементы.Добавить(МассивВремени[1], МассивВремени[2]);
		НовыйЭлемент.Текст = СтрСоединить(МассивСтрок);
		НовыйЭлемент.Значение = Выборка.СсылкаНаЖурнал.Ссылка;
		НовыйЭлемент.ЦветФона = СостояниеЗанятия(НовыйЭлемент, МассивВремени);
	КонецЦикла;
КонецПроцедуры

// Изменение фона занятия (вызывается при вызове ЗаполнитьРасписание())
Функция СостояниеЗанятия(ЭлементРасписания, МассивВремени)
	ЦветПрошел = Новый Цвет(255, 69, 0);
	ЦветИдет = Новый Цвет(255, 255, 0);
	ЦветБудет = Новый Цвет(173, 255, 47);
	Если МассивВремени[1] < МассивВремени[0] И МассивВремени[2] < МассивВремени[0] Тогда
		Возврат ЦветПрошел;
	ИначеЕсли МассивВремени[1] < МассивВремени[0] И МассивВремени[2] > МассивВремени[0] Тогда
		Возврат ЦветИдет;
	ИначеЕсли МассивВремени[1] > МассивВремени[0] И МассивВремени[2] > МассивВремени[0] Тогда
		Возврат ЦветБудет;
	Иначе
		Сообщить("Логическая ошибка!");
	КонецЕсли
КонецФункции

// Переделать из открытия СоставлениеРасписания на необходимый ЖУРНАЛ
#Область Расписание

// Открытие документа при нажатии на элемент планировщика
&НаКлиенте
Процедура РасписаниеПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.ПроведениеЗанятия.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

// Открытие документа при двойном нажатии
&НаКлиенте
Процедура РасписаниеПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
	
	ОткрытьФорму("Документ.ПроведениеЗанятия.Форма.ФормаДокумента", ПараметрыФормы);
КонецПроцедуры

// Запрет создания
&НаКлиенте
Процедура РасписаниеПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ВыделенныеЭлементы = 0 Тогда
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ВыделенныеЭлементы[0].Значение);
		ОткрытьФорму("Документ.ПроведениеЗанятия.Форма.ФормаДокумента", ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

// Кнопка обновить
&НаКлиенте
Процедура Обновить(Элемент)
	ЗаполнитьРасписание()
КонецПроцедуры

#КонецОбласти
