// Заполняет значения подвала при открытии формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеПодвала();
КонецПроцедуры

// Создает строку во второй таблицы для детализации
&НаКлиенте
Процедура СодержаниеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Объект.Детализация.Добавить();
КонецПроцедуры

// Запрещает удаление строки детализации
&НаКлиенте
Процедура ДетализацияПередУдалением(Элемент, Отказ)
	Предупреждение("Нельзя удалять строки в детализации!",5,"Предупреждение");
	Отказ = Истина;
КонецПроцедуры

// Удаляет строку в двух таблицах с обновлением подвала
&НаКлиенте
Процедура СодержаниеПередУдалением(Элемент, Отказ)
	ТекущаяСтрока = Элементы.Содержание.ТекущаяСтрока;
	НомерСтроки = Объект.Содержание.НайтиПоИдентификатору(ТекущаяСтрока).НомерСтроки;
	
	Объект.Детализация.Удалить(НомерСтроки - 1);
	
	ОбновлениеПодвала();
КонецПроцедуры

// Переносит часы из рабочей программы в обе таблицы
&НаКлиенте
Процедура СодержаниеРабочаяПрограммаПриИзменении(Элемент)
	// установление редактируемой строки содержания
	ТекущаяСтрока = Элементы.Содержание.ТекущаяСтрока;
	НомерСтроки = Объект.Содержание.НайтиПоИдентификатору(ТекущаяСтрока).НомерСтроки - 1;
	
	ЗаполнитьРабочуюПрограмму(НомерСтроки);
КонецПроцедуры

Процедура ЗаполнитьРабочуюПрограмму(НомерСтроки)
	// вытягивание рабочей программы редактируемой строки
	РабочаяПрограмма = Объект.Содержание[НомерСтроки].РабочаяПрограмма;
	// установление редактируемой строки содержания
	СтрокаСод = Объект.Содержание[НомерСтроки];
	// установление редактируемой строки детализации (на основе строки содержания)
	СтрокаДет = Объект.Детализация[НомерСтроки];
	
	// объявление хранимых переменных
	ВсегоЧасов1 = 0;
	ЧасыКонс1 = 0;
	ЧасыЛекц1 = 0;
	ЧасыПрак1 = 0;
	ЧасыАтт1 = 0;
	
	ВсегоЧасов2 = 0;
	ЧасыКонс2 = 0;
	ЧасыЛекц2 = 0;
	ЧасыПрак2 = 0;
	ЧасыАтт2 = 0;
	
	// проход по тематическому плану рабочей программы
	Для Каждого Занятие Из РабочаяПрограмма.ТематическийПлан Цикл
		// проверка на соответствие семестра с курсом
		Если Занятие.Семестр.Родитель = Объект.Курс Тогда
			// проверка для I полугодия
			Если Занятие.Семестр = Справочники.НастройкаКурса.Первый Или Занятие.Семестр = Справочники.НастройкаКурса.Третий Или Занятие.Семестр = Справочники.НастройкаКурса.Пятый Тогда
				// проверка лекций
				Если Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Лекция Тогда
					ВсегоЧасов1 = ВсегоЧасов1 + 1;
					ЧасыЛекц1 = ЧасыЛекц1 + 1;
					
				// проверка практических
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПрактическоеЗанятие Тогда
					ВсегоЧасов1 = ВсегоЧасов1 + 1;
					ЧасыПрак1 = ЧасыПрак1 + 1;
					
				// проверка самостоятельных
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.СамостоятельнаяРабота Тогда
					ВсегоЧасов1 = ВсегоЧасов1 + 1;
					
				// проверка консультаций
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Консультация Тогда
					ВсегоЧасов1 = ВсегоЧасов1 + 1;
					ЧасыКонс1 = ЧасыКонс1 + 1;
					
				// провекра аттестации
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПромежуточнаяАттестация Тогда
					ВсегоЧасов1 = ВсегоЧасов1 + 1;
					ЧасыАтт1 = ЧасыАтт1 + 1;
					ВидАтт1 = Занятие.ПромежуточнаяАттестация;
				КонецЕсли;
			
			// проверка для II полугодия
			ИначеЕсли Занятие.Семестр = Справочники.НастройкаКурса.Второй Или Занятие.Семестр = Справочники.НастройкаКурса.Четвертый Или Занятие.Семестр = Справочники.НастройкаКурса.Шестой Тогда
				// проверка лекций
				Если Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Лекция Тогда
					ВсегоЧасов2 = ВсегоЧасов2 + 1;
					ЧасыЛекц2 = ЧасыЛекц2 + 1;
					
				// проверка практических
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПрактическоеЗанятие Тогда
					ВсегоЧасов2 = ВсегоЧасов2 + 1;
					ЧасыПрак2 = ЧасыПрак2 + 1;
					
				// проверка самостоятельных
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.СамостоятельнаяРабота Тогда
					ВсегоЧасов2 = ВсегоЧасов2 + 1;
					
				// проверка консультаций
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.Консультация Тогда
					ВсегоЧасов2 = ВсегоЧасов2 + 1;
					ЧасыКонс2 = ЧасыКонс2 + 1;
					
				// провекра аттестации
				ИначеЕсли Занятие.ФормаОрганизации = Перечисления.ФормаОрганизацииОбучения.ПромежуточнаяАттестация Тогда
					ВсегоЧасов2 = ВсегоЧасов2 + 1;
					ЧасыАтт2 = ЧасыАтт2 + 1;
					ВидАтт2 = Занятие.ПромежуточнаяАттестация;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// запись результатов в строку содержания
	СтрокаСод.ВсегоЧасов = ВсегоЧасов1 + ВсегоЧасов2;
	СтрокаСод.ВсегоЧасовЛекции = ЧасыЛекц1 + ЧасыЛекц2;
	СтрокаСод.ВсегоЧасовПрактики = ЧасыПрак1 + ЧасыПрак2;
	СтрокаСод.ВсегоЧасовАттестации = ЧасыАтт1 + ЧасыАтт2;
	
	// запись семестров и недель в строку содержания
	Семестры = Справочники.ПериодыОбучения.Выбрать(,Объект.УчебныйГод);
	Семестры.Следующий();
	Если Не СтрокаДет.ВсегоЧасов_I = 0 Тогда
		Семестр1 = Семестры.ПолучитьОбъект().Ссылка;
		СтрокаДет.ЧислоНедель_I = Семестр1.КоличествоНедель;
		СтрокаДет.Семестр_I = Семестр1;
	КонецЕсли;
	
	Семестры.Следующий();
	Если Не СтрокаДет.ВсегоЧасов_II = 0 Тогда
		Семестр2 = Семестры.ПолучитьОбъект().Ссылка;
		СтрокаДет.ЧислоНедель_II = Семестр2.КоличествоНедель;
		СтрокаДет.Семестр_II = Семестр2;
	КонецЕсли;
	
	// запись результатов в строку детализации
	СтрокаДет.ВсегоЧасов_I = ВсегоЧасов1;
	СтрокаДет.ЧасыКонсультаций_I = ЧасыКонс1;
	СтрокаДет.ЧасыЛекций_I = ЧасыЛекц1;
	СтрокаДет.ЧасыПрактики_I = ЧасыПрак1;
	СтрокаДет.ЧасыАттестации_I = ЧасыАтт1;
	СтрокаДет.ВидАттестации_I = ВидАтт1;
	
	СтрокаДет.ВсегоЧасов_II = ВсегоЧасов2;
	СтрокаДет.ЧасыКонсультаций_II = ЧасыКонс2;
	СтрокаДет.ЧасыЛекций_II = ЧасыЛекц2;
	СтрокаДет.ЧасыПрактики_II = ЧасыПрак2;
	СтрокаДет.ЧасыАттестации_II = ЧасыАтт2;
	СтрокаДет.ВидАттестации_II = ВидАтт2;
	
	// обновление подвала
	ОбновлениеПодвала();
КонецПроцедуры

// Выставляет сумму значений в подвале
Процедура ОбновлениеПодвала()
	// объявление хранимых переменных
	ВсегоЧасов = 0;
	ЧасыКонс = 0;
	ЧасыЛекц = 0;
	ЧасыПрак = 0;
	
	ВсегоЧасов1 = 0;
	ЧасыКонс1 = 0;
	ЧасыЛекц1 = 0;
	ЧасыПрак1 = 0;
	ЧасыАтт1 = 0;
	
	ВсегоЧасов2 = 0;
	ЧасыКонс2 = 0;
	ЧасыЛекц2 = 0;
	ЧасыПрак2 = 0;
	ЧасыАтт2 = 0;
	
	// проход по детализации
	Для Каждого Строка Из Объект.Детализация Цикл
		// подсчет значений детализации
		ВсегоЧасов1 = ВсегоЧасов1 + Строка.ВсегоЧасов_I;
		ЧасыКонс1 = ЧасыКонс1 + Строка.ЧасыКонсультаций_I;
		ЧасыЛекц1 = ЧасыЛекц1 + Строка.ЧасыЛекций_I;
		ЧасыПрак1 = ЧасыПрак1 + Строка.ЧасыПрактики_I;
		ЧасыАтт1 = ЧасыАтт1 + Строка.ЧасыАттестации_I;
		
		ВсегоЧасов2 = ВсегоЧасов2 + Строка.ВсегоЧасов_II;
		ЧасыКонс2 = ЧасыКонс2 + Строка.ЧасыКонсультаций_II;
		ЧасыЛекц2 = ЧасыЛекц2 + Строка.ЧасыЛекций_II;
		ЧасыПрак2 = ЧасыПрак2 + Строка.ЧасыПрактики_II;
		ЧасыАтт2 = ЧасыАтт2 + Строка.ЧасыАттестации_II;
	КонецЦикла;
	
	// подсчет значений содержания
	ВсегоЧасов = ВсегоЧасов1 + ВсегоЧасов2;
	ЧасыЛекц = ЧасыЛекц1 + ЧасыЛекц2;
	ЧасыПрак = ЧасыПрак1 + ЧасыПрак2;
	ЧасыАтт = ЧасыАтт1 + ЧасыАтт2;
	
	// запись значения в шапку
	Объект.СуммаЧасов = ВсегоЧасов;
	
	// запись значений в подвал
	Элементы.ДетализацияВсегоЧасов_I.ТекстПодвала = ВсегоЧасов1;
	Элементы.ДетализацияЧасыКонсультаций_I.ТекстПодвала = ЧасыКонс1;
	Элементы.ДетализацияЧасыЛекций_I.ТекстПодвала = ЧасыЛекц1;
	Элементы.ДетализацияЧасыПрактики_I.ТекстПодвала = ЧасыПрак1;
	Элементы.ДетализацияЧасыАттестации_I.ТекстПодвала = ЧасыАтт1;
	
	Элементы.ДетализацияВсегоЧасов_II.ТекстПодвала = ВсегоЧасов2;
	Элементы.ДетализацияЧасыКонсультаций_II.ТекстПодвала = ЧасыКонс2;
	Элементы.ДетализацияЧасыЛекций_II.ТекстПодвала = ЧасыЛекц2;
	Элементы.ДетализацияЧасыПрактики_II.ТекстПодвала = ЧасыПрак2;
	Элементы.ДетализацияЧасыАттестации_II.ТекстПодвала = ЧасыАтт2;
	
	Элементы.СодержаниеВсегоЧасов.ТекстПодвала = ВсегоЧасов;
	Элементы.СодержаниеВсегоЧасовЛекции.ТекстПодвала = ЧасыЛекц;
	Элементы.СодержаниеВсегоЧасовПрактики.ТекстПодвала = ЧасыПрак;
	Элементы.СодержаниеВсегоЧасовАттестации.ТекстПодвала = ЧасыАтт;
КонецПроцедуры