Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ");
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТекПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ТекПользователь = Выборка.Ссылка;
	КонецЕсли;
	ПараметрыСеанса.ТекущийПользователь = ТекПользователь;
	
	// Настройка начальной страницы для каждого пользователя
	НастройкиНачальнойСтраницы = Новый НастройкиНачальнойСтраницы;
	СоставФорм = Новый СоставФормНачальнойСтраницы;
	
	Если РольДоступна("Администратор") Тогда
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельАдминистратора");
	ИначеЕсли РольДоступна("Администрация") Тогда 
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельАдминистрации");
	ИначеЕсли РольДоступна("Завуч") Тогда 
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельЗавуча");
	ИначеЕсли РольДоступна("Методист") Тогда 
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельМетодиста");
	ИначеЕсли РольДоступна("Преподаватель") Тогда 
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельПреподавателя");
	ИначеЕсли РольДоступна("СтуденческийОтдел") Тогда 
		СоставФорм.ЛеваяКолонка.Добавить("Обработка.ПанельРабочейОбласти.Форма.ПанельОтдела");
	КонецЕсли;
	
	НастройкиНачальнойСтраницы.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", , НастройкиНачальнойСтраницы);
КонецПроцедуры