
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос=Новый Запрос;
	Запрос.Текст= "
	|ВЫБРАТЬ
	|	Пользователи.Логин КАК Логин,
	|	Пользователи.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Объект.Логин);
	Результат=Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Если Результат.Количество() = 0 ИЛИ ТекущийОбъект.УникальныйИдентификатор = Результат.УникальныйИдентификатор Тогда
			ПользовательСсылка = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.УникальныйИдентификатор);
			Если ПользовательСсылка = Неопределено Тогда
				НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
				НовыйПользователь.Имя = Объект.Логин;
				НовыйПользователь.Пароль = Объект.Пароль;
				НовыйПользователь.ПолноеИмя = Объект.Наименование;
				
				Если Объект.Роль = Перечисления.Роли.Администратор Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Администрация Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администрация);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Завуч Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Методист Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист);
				ИначеЕсли Объект.Роль = Перечисления.Роли.Преподаватель Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
				ИначеЕсли Объект.Роль = Перечисления.Роли.СтуденческийОтдел Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
				КонецЕсли;
				
				НовыйПользователь.ПоказыватьВСпискеВыбора = Ложь;
				
				НовыйПользователь.Записать();
				ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
			Иначе
				ПользовательСсылка.Пароль=Объект.Пароль;
				ПользовательСсылка.ПолноеИмя=Объект.Наименование;
				ПользовательСсылка.Роли.Очистить();
				Если Объект.Роль=Перечисления.Роли.Администратор Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администратор);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Администрация Тогда
					ПользовательСсылка.Роли.Добавить(Метаданные.Роли.Администрация);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Завуч Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Методист Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист);
				ИначеЕсли Объект.Роль=Перечисления.Роли.Преподаватель Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
				ИначеЕсли Объект.Роль=Перечисления.Роли.СтуденческийОтдел Тогда
					НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
				КонецЕсли;
				
				ПользовательСсылка.Записать();
			КонецЕсли;
		Иначе
			Сообщ=Новый СообщениеПользователю;
			Сообщ.Текст="Пользователь с таким логином уже существует!";
			Сообщ.Сообщить();
			Отказ=Истина;
		КонецЕсли;
	Иначе
		НовыйПользователь=ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя=Объект.Логин;
		НовыйПользователь.Пароль=Объект.Пароль;
		НовыйПользователь.ПолноеИмя=Объект.Наименование; 
		Если Объект.Роль=Перечисления.Роли.Администратор Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администратор);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Администрация Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Администрация);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Завуч Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Завуч);
		ИначеЕсли Объект.Роль=Перечисления.Роли.Методист Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Методист); 
		ИначеЕсли Объект.Роль=Перечисления.Роли.Преподаватель Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Преподаватель);
		ИначеЕсли Объект.Роль=Перечисления.Роли.СтуденческийОтдел Тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.СтуденческийОтдел);
		КонецЕсли;
		
		НовыйПользователь.ПоказыватьВСпискеВыбора=Ложь;

		НовыйПользователь.Записать();
		ТекущийОбъект.УникальныйИдентификатор=НовыйПользователь.УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователя(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Ответ = Вопрос("Вы уверены, что хотите удалить пользователя " + Объект.Наименование 
		+ "?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Внимание");
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			УдалитьПоИдентификатору();
			ЭтотОбъект.Закрыть();
			Сообщить("Пользователь ИБ удален. Не забудьте поставить отметку об удалении.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПоИдентификатору()
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.УникальныйИдентификатор);
	ПользовательИБ.Удалить();
КонецПроцедуры
