
&НаКлиенте
Процедура СоздатьПротоколы(Команда)
	Если Объект.Проведен = Истина Тогда
		Ответ = Вопрос("Сгенерировать протоколы на каждого студента данной группы?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДИалога.Да, "Генерация протоколов");
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			УспешноСозданные = 0;
			Для Каждого Обучающийся Из Объект.Обучающиеся Цикл
				СоздатьПротоколыНаСервере(Обучающийся.ФИО, Обучающийся.Тема, Обучающийся.НаПримере, Обучающийся.Руководитель);
				УспешноСозданные = УспешноСозданные + 1;
			КонецЦикла;
			Сообщить("Успешно создано: " + УспешноСозданные + " протоколов");
		КонецЕсли;
		
	Иначе
		Сообщить("Команда работает только с проведенными документами!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПротоколыНаСервере(ФИО, Тема, НаПримере, Руководитель)
	НовыйДокумент = Документы.ПротоколДипломнойРаботы.СоздатьДокумент();
	
	НовыйДокумент.Дата = Объект.Дата;
	НовыйДокумент.Основание = Объект.Ссылка;
	
	НовыйДокумент.Группа = Объект.Группа;
	НовыйДокумент.Обучающийся = ФИО;
	НовыйДокумент.Руководитель = Руководитель;
	НовыйДокумент.Тема = Тема;
	НовыйДокумент.НаПримере = НаПримере;
	
	НовыйДокумент.Записать();
КонецПроцедуры