
&НаСервере
Процедура ОбновитьСписокПользователейНаСервере()
	//Добавить обход существующих записей!!!
	СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из СписокПользователейИБ Цикл
		Пользователь = Справочники.Пользователи.СоздатьЭлемент();
		Пользователь.Наименование = ПользовательИБ.Имя;
		Пользователь.ПолноеИмя = ПользовательИБ.ПолноеИмя;
		Пользователь.ПоказыватьВСпискеВыбора = ПользовательИБ.ПоказыватьВСпискеВыбора;
		Пользователь.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
		
		Пользователь.ОбменДанными.Загрузка = Истина;
		
		Пользователь.Записать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан новый пользователь в справочнике: " + Пользователь.Наименование;
		Сообщение.Сообщить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователей(Команда)
	Ответ = Вопрос("Вы уверены в обновлении списка? При выполнении команды будут добавлены пользователи независимо от данного списка. Есть риск создать дубликаты!"
	, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Предупреждение");
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьСписокПользователейНаСервере();
	КонецЕсли;
КонецПроцедуры
