
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.Проведен Тогда
		Если Объект.Абитуриенты = 0 Тогда
			Сообщить("Необходимо добавить минимум одного абитуриента!");
			Отказ = Истина;
			
		Иначе
			
			СтрокаТабличнойЧасти = Элементы.Абитуриенты.ТекущиеДанные;
			
			Для Каждого СтрокаТабличнойЧасти Из Объект.Абитуриенты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Группа) Тогда
					Сообщить("Группа не заполнена! Проверьте корректность заполнения документа!");
					Отказ = Истина;
					
				Иначе Отказ = РаботаДокументов.ПроверкаСтудентаВГруппе(СтрокаТабличнойЧасти.ФИО); КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
