Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр АктуальнаяГруппаСтудента
	Движения.АктуальностьКонтингента.Записывать = Истина;
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл
		Движение = Движения.АктуальностьКонтингента.Добавить();
		Движение.Период = Дата;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.ФИО;
		Движение.Обучается = Ложь;
		Движение.ДвижениеКонтингента = Перечисления.ДвижениеКонтингента.Отчисление;
		Движение.Причина = "Выпуск обучающегося";
	КонецЦикла;
	
	// регистр АктивныйКонтингент
	Движения.АктивныйКонтингент.Записывать = Истина;
	Для Каждого ТекСтрокаОбучающиеся Из Обучающиеся Цикл
		Движение = Движения.АктивныйКонтингент.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Обучающийся = ТекСтрокаОбучающиеся.ФИО;
		Движение.Обучаются = 0;
	КонецЦикла;
	
КонецПроцедуры

